Revit 2024 API
RebarShapeConstraint180DegreeBendRadius Class
 A constraint which can be applied to a RebarShapeSegment, and causes the segment to be replaced with a 180-degree arc. The associated parameter drives the radius of the arc.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class RebarShapeConstraint180DegreeBendRadius : RebarShapeConstraint
Visual Basic
Public Class RebarShapeConstraint180DegreeBendRadius _
	Inherits RebarShapeConstraint
Visual C++
public ref class RebarShapeConstraint180DegreeBendRadius : public RebarShapeConstraint
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.RebarShapeConstraint
 Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeBendRadius
See Also
RebarShapeConstraint180DegreeBendRadius Members
Autodesk.Revit.DB.Structure Namespace